Repository: matteodf/csv-to-acf
Catalog: languages/csv-to-acf-*.po
Languages: it_it

source: CSV to ACF Importer
it_it: Importatore CSV in ACF

source: Import CSV data into new pages creating proper ACF fields
it_it: Importa dati CSV in nuove pagine creando anche i campi ACF corretti

source: Version
it_it: Versione

source: This plugin allows you to import data from a CSV file into a new post with properly configurated ACF fields.
it_it: Questo plugin ti permette di importare dati da un file CSV in nuove pagine con campi ACF preconfigurati.

source: To use the plugin, you must follow these rules:
it_it: Per usare il plugin devi seguire queste regole:

source: The first row must contain the field names, or at least an indication of the content of each column.
it_it: La prima riga deve contenere i nomi dei campi, o almeno un'indicazione del contenuto di ogni colonna.

source: Each other row must contain the data to be imported.
it_it: Ogni altra riga deve contenere i dati da importare.

source: The first column must contain the post title.
it_it: La prima colonna deve contenere il titolo della pagina.

source: Image fields must contain the image URL. The URL must be linked to the image file, not to the page where the image is displayed.
it_it: I campi immagine devono contenere l'URL dell'immagine. L'URL deve puntare al file dell'immagine, non alla pagina dove l'immagine è visualizzata.

source: When the image link does not provide the extension of the image, the plugin sets it to .jpg by default.
it_it: Quando il link dell'immagine non fornisce l'estensione dell'immagine, il plugin la imposta di default a .jpg.

source: Important:
it_it: Importante:

source: the plugin will not import data into existing posts.
it_it: il plugin non importerà dati in pagine esistenti.

source: Warning:
it_it: Attenzione:

source: the plugin currently supports only the following field types: text, image, link, oembed
it_it: il plugin al momento supporta soltanto i seguenti tipi di custom fields: testo, immagine, link, oembed

source: Start importing
it_it: Inizia l'importazione

source: First step: select the CSV file to be imported
it_it: Primo step: seleziona il file CSV da importare

source: Go back
it_it: Torna indietro

source: Continue
it_it: Continua

source: Second step: ACF Group settings
it_it: Secondo step: impostazioni del gruppo ACF

source: Here you can set the ACF group settings. You can select the post type where the fields will be displayed and the title of the group.
it_it: Qui puoi settare le impostazioni del gruppo ACF. Puoi selezionare il tipo di post in cui verranno visualizzati i campi, il titolo del gruppo e la chiave del gruppo.

source: the title of the group must be unique.
it_it: la chiave del gruppo deve essere unica.

source: Post type
it_it: Tipo di post

source: ACF Group title
it_it: Titolo del gruppo ACF

source: Third step: ACF fields settings
it_it: Terzo step: impostazioni dei campi ACF

source: Here you can set the ACF fields settings. You can select the type of field, the label, the key and the name of the field.
it_it: Qui puoi settare le impostazioni dei campi ACF. Puoi selezionare il tipo di campo, l'etichetta, la chiave e il nome del campo.

source: You can click on the "Autofill" button to automatically fill the fields with the data from the CSV file.
it_it: Puoi cliccare sul pulsante "Autocompila" per riempire automaticamente i campi con i dati del file CSV.

source: the key of the field must be unique.
it_it: la chiave del campo deve essere unica.

source: Autofill
it_it: Autocompila

source: Create fields
it_it: Crea campi

source: Fourth step: import data
it_it: Quarto step: importa dati

source: The fields have been created. Now you can import the data from the CSV file and create the posts.
it_it: I campi sono stati creati. Ora puoi importare i dati dal file CSV e creare i post.

source: You can select if you want to publish or draft the posts.
it_it: Puoi selezionare se vuoi pubblicare o creare come bozza i post.

source: the plugin will not import data into existing posts. It will only create new posts.
it_it: il plugin non importerà dati in pagine esistenti. Creerà solo nuovi post.

source: Publish or draft the posts
it_it: Pubblica o crea come bozza i post

source: Publish
it_it: Pubblica

source: Draft
it_it: Bozza

source: Import data
it_it: Importa dati

source: Importing data...
it_it: Importazione dati...

source: Please wait while the data is being imported. This may take a while depending on the size of the CSV file.
it_it: Attendere mentre i dati vengono importati. Questo passaggio può richiedere un po' di tempo a seconda della dimensione del file CSV.

source: Import completed!
it_it: Importazione completata!

source: The data has been imported successfully.
it_it: I dati sono stati importati con successo.

source: You can now go to the posts page and check the imported data.
it_it: Ora puoi andare nella pagina dei post e controllare i dati importati.

source: If you liked this plugin, please consider leaving a star on
it_it: Se ti è piaciuto questo plugin, considera di lasciare una stella su

source: If you have any questions or suggestions, please contact me on
it_it: Se hai domande o suggerimenti, contattami sul

source: my website
it_it: mio sito web

source: This plugin is still in beta. If you find any bugs or have any suggestions, feel free to open an issue or a pull request on
it_it: Questo plugin è ancora in beta. Se trovi bug o hai suggerimenti, sentiti libero di aprire una issue o una pull request su

source: Thank you for using this plugin!
it_it: Grazie per aver usato questo plugin!

source: Start over
it_it: Ricomincia
